---
kind: type
id: T:Autodesk.Revit.DB.AssemblyViewUtils
source: html/4c839bed-9f56-c255-afba-8152c9171a22.htm
---
# Autodesk.Revit.DB.AssemblyViewUtils

Utilities that provide capabilities related to assembly view creation and validation.

## Syntax (C#)
```csharp
public static class AssemblyViewUtils
```